from random import randrange

classes = {
    "Математика": ["л", "пр"],
    "Алгебра": ["л", "пр"],
    "Геометрия": ["л", "пр"],
    "Информатика(ИКТ)": ["л", "пр", "лаб"],
    "История": ["л"],
    "География": ["л", "лаб"],
    "Экономика": ["л", "пр"],
    "Природоведение": ["л", "пр", "лаб"],
    "Биология": ["л", "пр", "лаб"],
    "Физика": ["л", "пр", "лаб"],
    "Химия": ["л", "пр", "лаб"],
    "Естествознание": ["л", "пр", "лаб"],
    "Астрономия": ["л", "пр", "лаб"],
    "Обществознание": ["л", "пр"],
    "Русский язык": ["л", "пр"],
    "Литература": ["л", "пр", ],
    "Иностранный язык": ["л", "пр"],
    "Физкультура": ["пр"],
    "Основы безопасности жизнедеятельности (ОБЖ)": ["л", "пр"]
}

with open("file for task 6 v2.txt", "w+", encoding="utf-8") as file:
    for key, val in classes.items():
        l, pr, lab = None, None, None
        for el in val:
            if el == "л":
                l = (str(randrange(5, 50)) + f"({el})")
            if el == "пр":
                pr = (str(randrange(5, 50)) + f"({el})")
            if el == "лаб":
                lab = (str(randrange(5, 50)) + f"({el})")

        file.write(f"{key}: {l or '—'} {pr or '—'} {lab or '—'}\n")

    file.seek(0)
    content = file.read()
    print(f"Содержание файла:\n{content}")
